# ThermalMass Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisConstruction..::..ThermalMass Property
EnergyAnalysisConstruction Class See Also
---
The thermal mass value (Cth-value) of the construction.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double ThermalMass { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ThermalMass As Double
	Get
```

Visual C++
---
```text
public:
property double ThermalMass {
	double get ();
}
```

# See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace